{"title":"How Apple's Force Touch could change the way you use your next iPhone or iPad","images":["http://cnet3.cbsistatic.com/hub/i/r/2014/09/19/c7846f56-46c5-4c3c-8991-47e77808486e/resize/970x546/7712ed45e94894be5b09e25800a6f3fd/iphone-6-plus-ipad-mini04.jpg"],"body":"I'm more interested in Force Touch on an iPad than an iPhone, mainly for the potential to make better on-screen keyboards, or create realistic-feeling buttons, brushes and dashboard switches for creative painting, music, or photo/video editing apps. But based on how Force Touch is being used right now on the Watch and MacBook, it might not be as exciting for the average person unless new apps and software rise up to advantage of it. But it's important for Apple to make sure that Force Touch won't just be a gimmick. It has to do more than stand in for the sort of 'touch and hold' actions that already exist now to bring up menus, or pull up extra actions (like deleting apps, or copying and pasting photos and text). It needs to feel like a useful, extra dimension of control, and be well integrated across iOS 9 and apps. The Microsoft Surface Pro can already measure pressure sensitivity with its stylus, and so can the Samsung S-Pen on the Galaxy Note 5. But an extra layer of feedback via haptics on the iPad could be used to create sensations of textures, or could sense borders or layers. A larger-screened iPad Pro, which has been rumored for years, could work with that haptic-feedback, force-sensitive display along with a special stylus. For artists, this suggests true pressure-sensitive drawing and painting, a feature that's made specialized styluses and input pads so useful for graphic design. On an iPad with Force Touch, that software keyboard could get very interesting. If I could \"feel\" the keys and also know when I've clicked them, would I type better? And maybe Force Touch could help bring up additional functions just by pressing down. Capital letters, accents, symbols, numbers, even specific uses within apps -- think music-mixing, art tools or advanced calculators. I'm most excited about how it could create the feeling of real buttons and switches on a normal screen. Could it feel like I'm operating a virtual thermostat with real buttons, or a TV remote? Or more importantly, could it create a feeling of typing on actual keyboard? What will happen to Force Touch on a larger screen? I'm wondering if it will feel more like the trackpad on the MacBook, serving up a click that starts to feel truly real. Reports have already suggested Force Touch will be used to bring up sub-menus on iOS 9 much like on the Apple Watch, and to offer more flexible virtual buttons in apps. Enlarge ImageForce Touch keyboards, perhaps.\n                                            Sarah Tew/CNET\n                                         But the Apple Watch has a second haptics element: an all-new vibration component the company has dubbed the \"Taptic Engine.\" Unlike your phone's generic vibration alert, the Watch has enough versatility to generate subtle or more complex vibrations: It can make a single tap-like sensation (thus the name), instead of just a buzz. Likewise, the Apple Watch's Force Touch display will \"click\" when you press down on it, but it feels more like a gentle push inward, and clearly seems like it's triggering a vibration in the watch body. It's mainly used to bring up sub-menus: press in on the watch face while the Music app is running, and you can see options to shuffle songs or change audio sources. Press down on the watch face while it's displaying the time, and you can change faces or customize.   The MacBook's trackpad feels exactly like a regular trackpad, but its click is an illusion: it's really using haptics. There's a nested double-click that happens between the first \"click\" and what happens when you press down further. That extra second click can trigger contextual actions, like a variation of right-click. On a website, it brings up definitions of words or phrases you highlight. During video playback, it can selectively change playback speed. The Force Touch trackpad can sense variable levels of pressure, but right now its use is being explored subtly. But its feels real, like a real button-click. The Apple Watch has Force Touch built into its display. The new Retina MacBooks (both Pro and 12-inch) have Force Touch-enabled trackpads. But they feel completely different from each other. Force Touch combines a pressure-sensitive display (or a trackpad) with haptic feedback underneath. Game controllers like those with the Xbox One use advanced haptics to create \"rumble\" feelings and controller feedback. What makes Apple's Force Touch interesting, mainly, is the introduction of a pressure-sensitive touch display: most everyday touch screens currently available aren't pressure sensitive at all. \"Haptics\" by definition means any interaction involving touch, but there's difference between advanced haptics and the vibrations you already get on your phone. Instead of a buzz, you can could feel a single tap, or varying intensities of ripples. Enlarge ImageForce Touch on the Apple Watch: mostly for menus.\n                                            Sarah Tew/CNET\n                                         What would this feel like, and why would we want it? Apple's already released two products this year that have Force Touch, and each shows off the potential successes and pitfalls of what looks like Apple's most prominent new technology of 2015. Apple's next iPhones should be announced next month, but this is an \"S\" year. That means -- if Apple sticks to the pattern it's adhered to since 2008 -- that the 2015 iPhones will maintain the same basic design as last year's model, and focus instead on \"under the hood\" improvements. This year, the big feature upgrade looks like it'll be Force Touch: a pressure-sensitive display, with vibrating haptics underneath. Pressure-sensitive screens, haptic feedback: Why should you care? \n                                            Sarah Tew/CNET\n                                        "}